Lista5/app/views/albums/show.html.erb

SELECT "musics".* FROM "musics" WHERE "musics"."album_id" = $1  [["album_id", 1]]
---
  <tbody>
  <% @album.music.each do |music| %>