Lista5/app/views/musics/edit.html.erb

    <%= form.label :artist, 'Album' %>
    <%= form.collection_select(:album_id, Album.all, :id, :name) %>
---
SELECT "albums".* FROM "albums"

    <%= form.label :music_style_id, 'Estilo musical' %>
    <%= form.collection_select(:music_style_id, MusicStyle.all, :id, :name) %>
---
SELECT "music_styles".* FROM "music_styles"