Lista5/app/controllers/musics_controller.rb

  def index
    @musics = Music.all
---
SELECT "musics".* FROM "musics"

  def create
    music = Music.new(musics_params)
    begin
      music.save!
---
INSERT INTO "musics" ("name", "album_id", "explicit", "music_style_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "ol"], ["album_id", 1], ["explicit", true], ["music_style_id", 1], ["created_at", "2020-06-21 20:59:47.052539"], ["updated_at", "2020-06-21 20:59:47.052539"]]

  def edit
    @music = Music.find(params[:id])
---
SELECT  "musics".* FROM "musics" WHERE "musics"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    @music = Music.find(params[:id])
---
SELECT  "musics".* FROM "musics" WHERE "musics"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def destroy
    music = Music.find(params[:id])
    begin
      music.destroy!
---
SELECT  "musics".* FROM "musics" WHERE "musics"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "musics" WHERE "musics"."id" = $1  [["id", 2]]