Lista5/app/controllers/music_styles_controller.rb

SELECT "music_styles".* FROM "music_styles"
---
  def index
    @music_styles = MusicStyle.all